7767517
58 66
Input            input0                   0 1 input0 0=224 1=224 2=3
Convolution      Conv_0                   1 1 input0 192 0=64 1=7 11=7 2=1 12=1 3=2 13=2 4=3 14=3 15=3 16=3 5=1 6=9408
ReLU             Relu_1                   1 1 192 125
Pooling          MaxPool_2                1 1 125 126 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 126 126_splitncnn_0 126_splitncnn_1
Convolution      Conv_3                   1 1 126_splitncnn_1 195 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_4                   1 1 195 129
Convolution      Conv_5                   1 1 129 198 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
BinaryOp         Add_6                    2 1 198 126_splitncnn_0 132 0=0
ReLU             Relu_7                   1 1 132 133
Split            splitncnn_1              1 2 133 133_splitncnn_0 133_splitncnn_1
Convolution      Conv_8                   1 1 133_splitncnn_1 201 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             Relu_9                   1 1 201 136
Convolution      Conv_10                  1 1 136 204 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
BinaryOp         Add_11                   2 1 204 133_splitncnn_0 139 0=0
ReLU             Relu_12                  1 1 139 140
Split            splitncnn_2              1 2 140 140_splitncnn_0 140_splitncnn_1
Convolution      Conv_13                  1 1 140_splitncnn_1 207 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             Relu_14                  1 1 207 143
Convolution      Conv_15                  1 1 143 210 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
Convolution      Conv_16                  1 1 140_splitncnn_0 213 0=128 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=8192
BinaryOp         Add_17                   2 1 210 213 148 0=0
ReLU             Relu_18                  1 1 148 149
Split            splitncnn_3              1 2 149 149_splitncnn_0 149_splitncnn_1
Convolution      Conv_19                  1 1 149_splitncnn_1 216 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             Relu_20                  1 1 216 152
Convolution      Conv_21                  1 1 152 219 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
BinaryOp         Add_22                   2 1 219 149_splitncnn_0 155 0=0
ReLU             Relu_23                  1 1 155 156
Split            splitncnn_4              1 2 156 156_splitncnn_0 156_splitncnn_1
Convolution      Conv_24                  1 1 156_splitncnn_1 222 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             Relu_25                  1 1 222 159
Convolution      Conv_26                  1 1 159 225 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
Convolution      Conv_27                  1 1 156_splitncnn_0 228 0=256 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=32768
BinaryOp         Add_28                   2 1 225 228 164 0=0
ReLU             Relu_29                  1 1 164 165
Split            splitncnn_5              1 2 165 165_splitncnn_0 165_splitncnn_1
Convolution      Conv_30                  1 1 165_splitncnn_1 231 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             Relu_31                  1 1 231 168
Convolution      Conv_32                  1 1 168 234 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
BinaryOp         Add_33                   2 1 234 165_splitncnn_0 171 0=0
ReLU             Relu_34                  1 1 171 172
Split            splitncnn_6              1 2 172 172_splitncnn_0 172_splitncnn_1
Convolution      Conv_35                  1 1 172_splitncnn_1 237 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1179648
ReLU             Relu_36                  1 1 237 175
Convolution      Conv_37                  1 1 175 240 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
Convolution      Conv_38                  1 1 172_splitncnn_0 243 0=512 1=1 11=1 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=131072
BinaryOp         Add_39                   2 1 240 243 180 0=0
ReLU             Relu_40                  1 1 180 181
Split            splitncnn_7              1 2 181 181_splitncnn_0 181_splitncnn_1
Convolution      Conv_41                  1 1 181_splitncnn_1 246 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             Relu_42                  1 1 246 184
Convolution      Conv_43                  1 1 184 249 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
BinaryOp         Add_44                   2 1 249 181_splitncnn_0 187 0=0
ReLU             Relu_45                  1 1 187 188
Pooling          GlobalAveragePool_46     1 1 188 189 0=1 4=1
Flatten          Flatten_47               1 1 189 190
InnerProduct     Gemm_48                  1 1 190 output0 0=2 1=1 2=1024
